<h1>Titanic data clean up and building a prediction model.</h1>

In [2]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

%matplotlib inline

In [3]:
df = pd.read_csv('titanic.csv')

In [4]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

<h1>Cleaning up fare values: </h1>
<ul>
    <li>find all people with the same ticket number and correct fare*</li>
    <li>find mean and standard deviation for all pclasses (excluding NaN and 0 values)</li>
    <li>find all indicies where the value of fare is NaN and 0 and correct them with previously calculated mean and std.</li>
    <li>for all rows where the fare is none, set fare value to according pclass mean + rand(-std, std)</li>
</ul>

<p>*for now this is just common sense to do this without knowing if this will bring any improvement at all, so this step is going to be ommited and will be applied in later version of prediction model (this is just to get first prediction model as fast as possible), but considering that we are going to shuffle all the data and split it into training set, cross validation set and test set it's a fair assumption that people with the same ticket number are going to end up in different sets and this, without adjusting the fare, is probably going to cause algorithm to get worse results.</p>

In [7]:
f = df
f.fare.fillna(0)
f = f[f.fare != 0]
f.head(5)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [38]:
# drop rows with all NaN values
f = f.dropna(axis=0, how='all')

<h1>Place for * step of fare clean up</h1>

In [51]:
pclass_fare = f[['pclass', 'fare']].pivot(columns='pclass', values='fare')
pclass_fare.sample(5)

pclass       1.0   2.0      3.0
851          NaN   NaN  14.1083
334          NaN  10.5      NaN
1115         NaN   NaN   7.7750
71      136.7792   NaN      NaN
25       26.0000   NaN      NaN

In [54]:
mean = pclass_fare.mean(axis=0, skipna=True)
mean

pclass
1.0    89.447482
2.0    21.648108
3.0    13.378473
dtype: float64

In [57]:
std = pclass_fare.std(axis=0, skipna=True)
std

pclass
1.0    80.259713
2.0    13.382064
3.0    11.483004
dtype: float64